xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_hal_sci.h
/** @defgroup SCI_Mode   SCI Mode
  * @{
  */
#define SCI_MODE_RX                        USART_CR1_RE                    /*!< RX mode        */
#define SCI_MODE_TX                        USART_CR1_TE                    /*!< TX mode        */
#define SCI_MODE_TX_RX                     (USART_CR1_TE | USART_CR1_RE)   /*!< RX and TX mode */
/**
  * @}
  */

/** @defgroup SCI_State  SCI State
  * @{
  */
#define SCI_STATE_DISABLE                  0x00000000U         /*!< SCI disabled  */
#define SCI_STATE_ENABLE                   USART_CR1_UE        /*!< SCI enabled   */
/**
  * @}
  */

/** @defgroup SCI_Over_Sampling SCI Over Sampling
  * @{
  */
#define SCI_OVERSAMPLING_16                    0x00000000U
#define SCI_OVERSAMPLING_8                     ((uint32_t)USART_CR3_OVER8)

/**
  * @}
  */

/** @defgroup SCI_AutoBaud_Rate_Mode    SCI Advanced Feature AutoBaud Rate Mode
  * @{
  */
#define SCI_ADVFEATURE_AUTOBAUDRATE_ONSTARTBIT    0x00000000U          /*!< Auto Baud rate detection
                                                                            on start bit              */
#define SCI_ADVFEATURE_AUTOBAUDRATE_ONFALLINGEDGE USART_CR3_ABRMOD_0   /*!< Auto Baud rate detection
                                                                            on falling edge           */
#define SCI_ADVFEATURE_AUTOBAUDRATE_ON0X7FFRAME   USART_CR3_ABRMOD_1   /*!< Auto Baud rate detection
                                                                            on 0x7F frame detection   */
#define SCI_ADVFEATURE_AUTOBAUDRATE_ON0X55FRAME   USART_CR3_ABRMOD     /*!< Auto Baud rate detection
                                                                            on 0x55 frame detection   */
/**
  * @}
  */

/** @defgroup SCI_Receiver_Timeout SCI Receiver Timeout
  * @{
  */
#define SCI_RECEIVER_TIMEOUT_DISABLE       0x00000000U                /*!< SCI Receiver Timeout disable */
#define SCI_RECEIVER_TIMEOUT_ENABLE        USART_CR2_RTOEN            /*!< SCI Receiver Timeout enable  */
/**
  * @}
  */

/** @defgroup SCI_LIN    SCI Local Interconnection Network mode
  * @{
  */
#define SCI_LIN_DISABLE                    0x00000000U                /*!< Local Interconnect Network disable */
#define SCI_LIN_ENABLE                     USART_CR2_LINEN            /*!< Local Interconnect Network enable  */
/**
  * @}
  */

/** @defgroup SCI_LIN_Break_Detection_Length  SCI LIN Break Detection Length
  * @{
  */
#define SCI_LINBREAKDETECTLENGTH_10B      0x00000000U                /*!< LIN 10-bit break detection length */
#define SCI_LINBREAKDETECTLENGTH_11B      USART_CR2_LBDL             /*!< LIN 11-bit break detection length */
/**
  * @}
  */

/** @defgroup SCI_DMA_Tx    SCI DMA Tx
  * @{
  */
#define SCI_DMA_TX_DISABLE                 0x00000000U                /*!< SCI DMA TX disabled */
#define SCI_DMA_TX_ENABLE                  USART_CR3_DMAT             /*!< SCI DMA TX enabled  */
/**
  * @}
  */

/** @defgroup SCI_DMA_Rx   SCI DMA Rx
  * @{
  */
#define SCI_DMA_RX_DISABLE                 0x00000000U                 /*!< SCI DMA RX disabled */
#define SCI_DMA_RX_ENABLE                  USART_CR3_DMAR              /*!< SCI DMA RX enabled  */
/**
  * @}
  */

/** @defgroup SCI_Half_Duplex_Selection  SCI Half Duplex Selection
  * @{
  */
#define SCI_HALF_DUPLEX_DISABLE            0x00000000U                 /*!< SCI half-duplex disabled */
#define SCI_HALF_DUPLEX_ENABLE             USART_CR3_HDSEL             /*!< SCI half-duplex enabled  */
/**
  * @}
  */

/** @defgroup SCI_WakeUp_functions  SCI Wakeup Functions
  * @{
  */
#define SCI_WAKEUPMETHOD_IDLELINE       0x00000000U                   /*!< SCI wake-up on idle line    */
#define SCI_WAKEUPMETHOD_ADDRESSMARK    USART_CR1_WAKE                /*!< SCI wake-up on address mark */
/**
  * @}
  */

/** @defgroup SCI_Request_Parameters  SCI Request Parameters
  * @{
  */
#define SCI_SENDBREAK_REQUEST           USART_CR1_SBK        /*!< Send Break Request          */
#define SCI_RXDATA_FLUSH_REQUEST        USART_CR1_RXFRQ        /*!< Receive Data flush Request  */
#define SCI_TXDATA_FLUSH_REQUEST        USART_CR1_TXFRQ        /*!< Transmit data flush Request */
/**
  * @}
  */

/** @defgroup SCI_Advanced_Features_Initialization_Type  SCI Advanced Feature Initialization Type
  * @{
  */
#define SCI_ADVFEATURE_NO_INIT                 0x00000000U          /*!< No advanced feature initialization       */
#define SCI_ADVFEATURE_DATAINVERT_INIT         0x00000001U          /*!< Binary data inversion                    */
#define SCI_ADVFEATURE_SWAP_INIT               0x00000002U          /*!< TX/RX pins swap                          */
#define SCI_ADVFEATURE_AUTOBAUDRATE_INIT       0x00000004U          /*!< Auto Baud rate detection initialization  */
#define SCI_ADVFEATURE_MSBFIRST_INIT           0x00000008U          /*!< Most significant bit sent/received first */
/**
  * @}
  */

/** @defgroup SCI_Data_Inv  SCI Advanced Feature Binary Data Inversion
  * @{
  */
#define SCI_ADVFEATURE_DATAINV_DISABLE     0x00000000U              /*!< Binary data inversion disable */
#define SCI_ADVFEATURE_DATAINV_ENABLE      USART_CR1_DATAINV       /*!< Binary data inversion enable  */
/**
  * @}
  */

/** @defgroup SCI_Rx_Tx_Swap SCI Advanced Feature RX TX Pins Swap
  * @{
  */
#define SCI_ADVFEATURE_SWAP_DISABLE        0x00000000U             /*!< TX/RX pins swap disable */
#define SCI_ADVFEATURE_SWAP_ENABLE         USART_CR1_SWAP          /*!< TX/RX pins swap enable  */
/**
  * @}
  */

/** @defgroup SCI_AutoBaudRate_Enable  SCI Advanced Feature Auto BaudRate Enable
  * @{
  */
#define SCI_ADVFEATURE_AUTOBAUDRATE_DISABLE   0x00000000U          /*!< RX Auto Baud rate detection enable  */
#define SCI_ADVFEATURE_AUTOBAUDRATE_ENABLE    USART_CR3_ABREN      /*!< RX Auto Baud rate detection disable */
/**
  * @}
  */

/** @defgroup SCI_MSB_First  SCI Advanced Feature MSB First
  * @{
  */
#define SCI_ADVFEATURE_MSBFIRST_DISABLE    0x00000000U             /*!< Most significant bit sent/received first disable                      */
#define SCI_ADVFEATURE_MSBFIRST_ENABLE     USART_CR1_MSBFIRST      /*!< Most significant bit sent/received first enable                       */
/**
  * @}
  */

/** @defgroup SCI_DriverEnable_Polarity      SCI DriverEnable Polarity
  * @{
  */
#define SCI_DE_POLARITY_HIGH              0x00000000U      /*!< Driver enable signal is active high */
#define SCI_DE_POLARITY_LOW               USART_CR2_DEP    /*!< Driver enable signal is active low  */
/**
  * @}
  */


/** @defgroup SCI_CR3_DEAT_ADDRESS_LSB_POS    SCI Driver Enable Assertion Time LSB Position In CR3 Register
  * @{
  */
#define SCI_CR3_DEAT_ADDRESS_LSB_POS       24U      /*!< SCI Driver Enable assertion time LSB
                                                         position in CR1 register */
/**
  * @}
  */

